app/Notifications/OrderNotification.php

select `items`.*, `order_has_items`.`order_id` as `pivot_order_id`, `order_has_items`.`item_id` as `pivot_item_id`, `order_has_items`.`qty` as `pivot_qty`, `order_has_items`.`extras` as `pivot_extras`, `order_has_items`.`vat` as `pivot_vat`, `order_has_items`.`vatvalue` as `pivot_vatvalue`, `order_has_items`.`variant_price` as `pivot_variant_price`, `order_has_items`.`variant_name` as `pivot_variant_name` from `items` inner join `order_has_items` on `items`.`id` = `order_has_items`.`item_id` where `order_has_items`.`order_id` = 616 and `items`.`deleted_at` is null
---
        //Add order details
        $message->line(__('Order items'));
        $message->line(__('________________'));
        foreach ($this->order->items as $key => $item) {