app/Traits/Payments/HasStripe.php

    public function payOrder(){
        try {
            $total_price = (int) (($this->order->order_price + $this->order->delivery_price) * 100);
            $chargeOptions = [];

            //Setup based on vendor
            if(config('settings.stripe_useVendor')){
                config(['settings.stripe_secret' => $this->vendor->getConfig('stripe_key','')]);
                config(['settings.stripe_key' => $this->vendor->getConfig('stripe_secret','')]);
            } else if (config('settings.enable_stripe_connect') && $this->vendor->user->stripe_account) {
                $chargeOptions=$this->stripeConnect();
            }

            //User to apply the charge to
            $user=auth()->user()?auth()->user():$this->vendor->user;

            if($this->order->isMobileOrder){
                //Mobile Order
                $srtipe_payment_id=$this->mobileCharge($total_price,$chargeOptions,$user);
            }else {
                //Web order
                $srtipe_payment_id=$this->webCharge($total_price,$chargeOptions,$user);
            }



            $this->order->srtipe_payment_id = $srtipe_payment_id;
            $this->order->payment_status = 'paid';
            $this->order->payment_processor_fee = ($total_price * config('settings.stripe_fee')/10000) + config('settings.stripe_static_fee');
            $this->order->update();
---
update `orders` set `payment_status` = 'paid', `srtipe_payment_id` = 'pi_1Inetr2eZvKYlo2CFcB5Ik3e', `payment_processor_fee` = 8.074, `orders`.`updated_at` = '2021-05-05 09:12:04' where `id` = 616