app/Restorant.php

select * from `hours` where `hours`.`restorant_id` = 17 and `hours`.`restorant_id` is not null
---
    public function getBusinessHours(){

        $creationArray=[
            'monday'     => [],
            'tuesday'    => [],
            'wednesday'  => [],
            'thursday'   => [],
            'friday'     => [],
            'saturday'   => [],
            'sunday'     => [],
            'overflow' => true
        ];

        $dayKeys=array_keys($creationArray);

        //Get all working hours
        $workingHours=$this->hours()->get()->toArray();