app/Repositories/Orders/BaseOrderRepository.php

    private function createOrder(){
        if($this->order==null){
            $this->order=new Order;
            $this->order->restorant_id=$this->vendor->id;
            $this->order->comment="";
            $this->order->payment_method=$this->request->payment_method;
            $this->order->payment_status="unpaid";

            $expeditionsTypes=['delivery'=>1,'pickup'=>2,'dinein'=>3]; //1- delivery 2 - pickup 3-dinein
            $this->order->delivery_method=$expeditionsTypes[$this->expedition];

            //Client
            if(auth()->user()){
                $this->order->client_id=auth()->user()->id;
            }

            //TODO Set initials like VAT, prices etc to 0
            $this->order->order_price=0;
            $this->order->vatvalue=0;

            //Save order
            $this->order->save();
---
insert into `orders` (`restorant_id`, `comment`, `payment_method`, `payment_status`, `delivery_method`, `client_id`, `order_price`, `vatvalue`, `updated_at`, `created_at`) values (17, '', 'stripe', 'unpaid', 2, 7, 0, 0, '2021-05-05 09:12:02', '2021-05-05 09:12:02')

        //After we have updated the list of items, we need to update the order price
        $order_price=0;
        $total_order_vat=0;
        foreach ($this->order->items()->get() as $key => $item) {
---
select `items`.*, `order_has_items`.`order_id` as `pivot_order_id`, `order_has_items`.`item_id` as `pivot_item_id`, `order_has_items`.`qty` as `pivot_qty`, `order_has_items`.`extras` as `pivot_extras`, `order_has_items`.`vat` as `pivot_vat`, `order_has_items`.`vatvalue` as `pivot_vatvalue`, `order_has_items`.`variant_price` as `pivot_variant_price`, `order_has_items`.`variant_name` as `pivot_variant_name` from `items` inner join `order_has_items` on `items`.`id` = `order_has_items`.`item_id` where `order_has_items`.`order_id` = 616 and `items`.`deleted_at` is null

        $this->order->vatvalue=$total_order_vat;

        //Update the order with the item
        $this->order->update();
---
update `orders` set `order_price` = 299, `orders`.`updated_at` = '2021-05-05 09:12:02' where `id` = 616

    private function setComment(){

        $comment = $this->request->comment ? strip_tags($this->request->comment.'') : '';
        $this->order->comment = $this->order->comment.' '.$comment;
        $this->order->update();
---
update `orders` set `comment` = ' ', `orders`.`updated_at` = '2021-05-05 09:12:02' where `id` = 616

    private function calculateFees(){
        $this->order->static_fee=$this->vendor->static_fee;
        $this->order->fee=$this->vendor->fee;
        $this->order->fee_value=($this->vendor->fee/100)*($this->order->order_price-$this->vendor->static_fee);
        $this->order->update();
---
update `orders` set `static_fee` = '0.00', `fee` = '10.00', `fee_value` = 29.9, `orders`.`updated_at` = '2021-05-05 09:12:02' where `id` = 616

    public function notifyOwner(){
        //Inform owner - via email, sms or db
        $this->vendor->user->notify((new OrderNotification($this->order))->locale(strtolower(config('settings.app_locale'))));
---
select * from `users` where `users`.`id` = '8' limit 1