app/Http/Controllers/BookingController.php

    public function index(Request $request)
    {
        $data['bookings'] = Booking::orderBy('id', 'DESC')
            ->get();
---
select * from `bookings` order by `id` desc