app/Http/Controllers/CartController.php

    public function add(Request $request)
    {
        $item = Items::find($request->id);
        $restID = $item->category->restorant->id;

        $restaurant = Restorant::findOrFail($restID);
---
select * from `categories` where `categories`.`id` = '69' limit 1
select * from `restorants` where `restorants`.`id` = '17' limit 1