app/Http/Controllers/FrontEndController.php

    public function taxi()
    {
        $catagories = Catagories::where('status', 1)->get();
---
select * from `catagories` where `status` = 1

        } else {
            //CASE 1 - nothing at all
            //No query at all
            array_push($sections, ['title'=>__('Popular restaurants'), 'restorants' =>Restorant::where('active', 1)->get()->shuffle()]);
        }

        $banners_data = Banners::all();
---
select * from `restorants` where `active` = 1
select * from `banners`

    public function restorant($alias)
    {

        //Do we have impressum app
        $doWeHaveImpressumApp=Module::has('impressum');


        $subDomain = $this->getSubDomain();
        if ($subDomain && $alias !== $subDomain) {
            return redirect()->route('restorant', $subDomain);
        }
        $restorant = Restorant::whereRaw('REPLACE(subdomain, "-", "") = ?', [str_replace("-","",$alias)])->first();

        //Set config based on restaurant
        config(['app.timezone' => $restorant->getConfig('time_zone',config('app.timezone'))]);


        if ($restorant->active == 1) {

            if(isset($_GET['pay'])){
                //This is a payment link
                $order=Order::findOrFail($_GET['pay']);
                if($order->restorant_id==$restorant->id){
                    return redirect($order->payment_link);
                }
            }

            $restorant->increment('views');
---
select * from `restorants` where REPLACE(subdomain, "-", "") = 'pizzapoint' limit 1
update `restorants` set `views` = `views` + 1, `restorants`.`updated_at` = '2021-05-05 09:50:45' where `id` = '17'

            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();
---
select * from `tables` where `restaurant_id` = 17