app/Http/Controllers/HomeController.php

    public function index()
    {
        if (! config('app.ordering')) {
            if (auth()->user()->hasRole('owner')) {
                return redirect()->route('admin.restaurants.edit', auth()->user()->restorant->id);
            } elseif (auth()->user()->hasRole('admin')) {
                return redirect()->route('admin.restaurants.index');
            }
        }
        $months = [
            0 => __('Jan'),
            1 => __('Feb'),
            2 => __('Mar'),
            3 => __('Apr'),
            4 => __('May'),
            5 => __('Jun'),
            6 => __('Jul'),
            7 => __('Aug'),
            8 => __('Sep'),
            9 => __('Oct'),
            10 => __('Nov'),
            11 => __('Dec'),
        ];

        if (auth()->user()->hasRole('admin')) {
            //first analytics
            $last30days = Carbon::now()->subDays(30);
            $last30daysOrders = Order::all()->where('created_at', '>', $last30days)->count();
            $last30daysOrdersValue = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('order_price');
            //$uniqueUsersOrders = Order::all()->unique('address_id')->count();
            $uniqueUsersOrders = Order::select('client_id')->groupBy('client_id')->get()->count();
---
select `client_id` from `orders` group by `client_id`


            //Last 7 months sales values
            $sevenMonthsDate = Carbon::now()->subMonths(6)->startOfMonth();
            $salesValue = DB::table('orders')
                        ->select(DB::raw('SUM(order_price + delivery_price) AS sumValue'))
                        ->where('created_at', '>', $sevenMonthsDate)
                        ->where('payment_status','paid')
                        ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                        ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                        ->pluck('sumValue');

            $monthLabels = DB::table('orders')
                        ->select(DB::raw('MONTH(created_at) as month'))
                        ->where('created_at', '>', $sevenMonthsDate)
                        ->where('payment_status','paid')
                        ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                        ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                        ->pluck('month');

            $totalOrders = DB::table('orders')
                        ->select(DB::raw('count(id) as totalPerMonth'))
                        ->where('created_at', '>', $sevenMonthsDate)
                        ->where('payment_status','paid')
                        ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                        ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                        ->pluck('totalPerMonth');
---
select SUM(order_price + delivery_price) AS sumValue from `orders` where `created_at` > '2020-11-01 00:00:00' and `payment_status` = 'paid' group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
select MONTH(created_at) as month from `orders` where `created_at` > '2020-11-01 00:00:00' and `payment_status` = 'paid' group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
select count(id) as totalPerMonth from `orders` where `created_at` > '2020-11-01 00:00:00' and `payment_status` = 'paid' group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc

            $last30daysDeliveryFee = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('delivery_price');
            $last30daysStaticFee = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('static_fee');
            $last30daysDynamicFee = Order::all()->where('created_at', '>', $last30days)->where('payment_status','paid')->sum('fee_value');
            $last30daysTotalFee = DB::table('orders')
                                ->select(DB::raw('SUM(delivery_price + static_fee + fee_value) AS sumValue'))
                                ->where('created_at', '>', $last30days)
                                ->where('payment_status','paid')
                                ->value('sumValue');
---
select SUM(delivery_price + static_fee + fee_value) AS sumValue from `orders` where `created_at` > '2021-04-05 13:06:31' and `payment_status` = 'paid' limit 1

            //dd(Carbon::now()->format('M'));
            $views = Restorant::sum('views');

            return view('dashboard', [
                'last30daysOrders' => $last30daysOrders,
                'last30daysOrdersValue'=> $last30daysOrdersValue,
                'uniqueUsersOrders' => $uniqueUsersOrders,
                'allClients' => $allClients,
                'allViews' => $views,
                'salesValue' => $salesValue,
                'monthLabels' => $monthLabels,
                'totalOrders' => $totalOrders,
                'countItems'=>Restorant::count(),
                'last30daysDeliveryFee' => $last30daysDeliveryFee,
                'last30daysStaticFee' => $last30daysStaticFee,
                'last30daysDynamicFee' => $last30daysDynamicFee,
                'last30daysTotalFee' => $last30daysTotalFee,
                'months' => $months,
            ]);
---
select * from `orders`
select * from `restorants` where `restorants`.`user_id` = 8 and `restorants`.`user_id` is not null limit 1


            $last30days = Carbon::now()->subDays(30);
            // $last30daysOrders = Order::all()->where('created_at', '>', $last30days, 'AND', 'restorant_id', '=' ,$restorant_id)->count();
            $last30daysOrders = Order::where([
                ['created_at', '>', $last30days],
                ['restorant_id', '=', $restorant_id],
            ])->count();

            //$last30daysOrdersValue = Order::all()->where('created_at', '>', $last30days, 'AND', 'restorant_id', '=', $restorant_id)->sum('order_price');
            $last30daysOrdersValue = Order::where([
                ['created_at', '>', $last30days],
                ['restorant_id', '=', $restorant_id],
                ['payment_status', '=', 'paid'],
            ])->sum('order_price');

            //$uniqueUsersOrders = Order::all()->unique('address_id')->where('restorant_id', '=', $restorant_id)->count();
            $uniqueUsersOrders = Order::select('client_id')->where('restorant_id', '=', $restorant_id)->groupBy('client_id')->get()->count();
---
select count(*) as aggregate from `orders` where (`created_at` > '2021-04-05 10:19:45' and `restorant_id` = 17)
select sum(`order_price`) as aggregate from `orders` where (`created_at` > '2021-04-05 10:19:45' and `restorant_id` = 17 and `payment_status` = 'paid')
select `client_id` from `orders` where `restorant_id` = 17 group by `client_id`

                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('sumValue');*/
            $salesValue = DB::table('orders')
                        ->select(DB::raw('SUM(order_price + delivery_price) AS sumValue'))
                        ->where([['created_at', '>', $sevenMonthsDate], ['restorant_id', '=', $restorant_id], ['payment_status', '=', 'paid']])
                        ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                        ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                        ->pluck('sumValue');
---
select SUM(order_price + delivery_price) AS sumValue from `orders` where (`created_at` > '2020-11-01 00:00:00' and `restorant_id` = 17 and `payment_status` = 'paid') group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc

                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('month');*/
            $monthLabels = DB::table('orders')
                        ->select(DB::raw('MONTH(created_at) as month'))
                        ->where([['created_at', '>', $sevenMonthsDate], ['restorant_id', '=', $restorant_id]])
                        ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                        ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                        ->pluck('month');
---
select MONTH(created_at) as month from `orders` where (`created_at` > '2020-11-01 00:00:00' and `restorant_id` = 17) group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc

                        ->groupBy(DB::raw("YEAR(created_at), MONTH(created_at)"))
                        ->orderBy(DB::raw("YEAR(created_at), MONTH(created_at)"), 'asc')
                        ->pluck('totalPerMonth');*/
            $totalOrders = DB::table('orders')
                        ->select(DB::raw('count(id) as totalPerMonth'))
                        ->where([['created_at', '>', $sevenMonthsDate], ['restorant_id', '=', $restorant_id]])
                        ->groupBy(DB::raw('YEAR(created_at), MONTH(created_at)'))
                        ->orderBy(DB::raw('YEAR(created_at), MONTH(created_at)'), 'asc')
                        ->pluck('totalPerMonth');

            $last30daysDeliveryFee = Order::where([['created_at', '>', $last30days], ['restorant_id', '=', $restorant_id]])->sum('delivery_price');
            $last30daysStaticFee = Order::where([['created_at', '>', $last30days], ['restorant_id', '=', $restorant_id]])->sum('static_fee');
            $last30daysDynamicFee = Order::where([['created_at', '>', $last30days], ['restorant_id', '=', $restorant_id]])->sum('fee_value');
            $last30daysTotalFee = DB::table('orders')
                                ->select(DB::raw('SUM(delivery_price + static_fee + fee_value) AS sumValue'))
                                ->where([['created_at', '>', $last30days], ['restorant_id', '=', $restorant_id]])
                                ->value('sumValue');
            $itemsCount = Items::whereIn('category_id', auth()->user()->restorant->categories->pluck('id')->toArray())->count();
---
select count(id) as totalPerMonth from `orders` where (`created_at` > '2020-11-01 00:00:00' and `restorant_id` = 17) group by YEAR(created_at), MONTH(created_at) order by YEAR(created_at), MONTH(created_at) asc
select sum(`delivery_price`) as aggregate from `orders` where (`created_at` > '2021-04-05 10:19:45' and `restorant_id` = 17)
select sum(`static_fee`) as aggregate from `orders` where (`created_at` > '2021-04-05 10:19:45' and `restorant_id` = 17)
select sum(`fee_value`) as aggregate from `orders` where (`created_at` > '2021-04-05 10:19:45' and `restorant_id` = 17)
select SUM(delivery_price + static_fee + fee_value) AS sumValue from `orders` where (`created_at` > '2021-04-05 10:19:45' and `restorant_id` = 17) limit 1
select count(*) as aggregate from `items` where `category_id` in (69) and `items`.`deleted_at` is null