app/Http/Controllers/HowItWorksController.php

    public function store(Request $request)
    {
        $update_id = $request->id;
        $data['name'] = $request->name;
        $data['status'] = 1;
        if (isset($update_id) && !empty($update_id) && $update_id != 0) {
            try {
                $update = HowItWorks::where('id', $update_id)
                    ->update($data);
---
update `how_it_works` set `name` = 'Payment', `status` = 1, `how_it_works`.`updated_at` = '2021-05-26 18:31:55' where `id` = '8'