app/Http/Controllers/OrderController.php

    public function index(Request $request)
    {
        $this->migrateStatuses();

        $restorants = Restorant::where(['active'=>1])->get();
---
select * from `restorants` where (`active` = 1)

    public function orderLocationAPI(Order $order)
    {
        if ($order->status->pluck('alias')->last() == 'picked_up') {
---
select `status`.*, `order_has_status`.`order_id` as `pivot_order_id`, `order_has_status`.`status_id` as `pivot_status_id`, `order_has_status`.`user_id` as `pivot_user_id`, `order_has_status`.`created_at` as `pivot_created_at`, `order_has_status`.`comment` as `pivot_comment` from `status` inner join `order_has_status` on `status`.`id` = `order_has_status`.`status_id` where `order_has_status`.`order_id` = 620 order by `order_has_status`.`id` asc

    public function liveapi()
    {

        //TODO - Method not allowed for client or driver
        if (auth()->user()->hasRole('client')) {
            dd('Not allowed as client');
        }

        //Today only
        $orders = Order::where('created_at', '>=', Carbon::today())->orderBy('created_at', 'desc');

        //If owner, only from his restorant
        if (auth()->user()->hasRole('owner')) {
            $orders = $orders->where(['restorant_id'=>auth()->user()->restorant->id]);

            //Change currency
            ConfChanger::switchCurrency(auth()->user()->restorant);

            //Change language
            //ConfChanger::switchLanguage($order->restorant);
        }
        $orders = $orders->with(['status', 'client', 'restorant', 'table.restoarea'])->get()->toArray();
---
select * from `orders` where `created_at` >= '2021-05-05 00:00:00' and (`restorant_id` = 17) order by `created_at` desc
select * from `restorants` where `restorants`.`id` in (17)
select * from `tables` where `tables`.`id` in ('')
select * from `users` where `users`.`id` in ('1', '7')

    public function updateStatus($alias, Order $order)
    {
        if (isset($_GET['driver'])) {
            $order->driver_id = $_GET['driver'];
            $order->update();

            //Now increment the driver orders
            $theDriver = User::findOrFail($order->driver_id);
            $theDriver->numorders = $theDriver->numorders + 1;
            $theDriver->update();
        }

        if (isset($_GET['time_to_prepare'])) {
            $order->time_to_prepare = $_GET['time_to_prepare'];
            $order->update();
        }

        $status_id_to_attach = Status::where('alias', $alias)->value('id');
---
select `id` from `status` where `alias` = 'accepted_by_restaurant' limit 1


        if (config('app.isft') && $alias.'' == 'delivered') {
            $order->payment_status = 'paid';
            $order->update();
---
update `orders` set `payment_status` = 'paid', `orders`.`updated_at` = '2021-05-05 10:19:28' where `id` = '615'