app/Http/Controllers/RestorantController.php

select * from `restorants` order by `id` desc limit 10 offset 0
select count(*) as aggregate from `restorants`
---
    public function index(Restorant $restaurants)
    {
        if (auth()->user()->hasRole('admin')) {
            //return view('restorants.index', ['restorants' => $restaurants->where(['active'=>1])->paginate(10)]);
            return view('restorants.index', ['restorants' => $restaurants->orderBy('id', 'desc')->paginate(10)]);

select * from `localmenus` where `localmenus`.`restaurant_id` = 17 and `localmenus`.`restaurant_id` is not null
---
    public function edit(Restorant $restaurant)
    {
        //dd($restaurant->getBusinessHours()->isOpen());

        //Days of the week
        $timestamp = strtotime('next Monday');
        for ($i = 0; $i < 7; $i++) {
            $days[] = strftime('%A', $timestamp);
            $timestamp = strtotime('+1 day', $timestamp);
        }

        //Generate days columns
        $hoursRange = ['id'];
        for ($i = 0; $i < 7; $i++) {
            $from = $i.'_from';
            $to = $i.'_to';

            array_push($hoursRange, $from);
            array_push($hoursRange, $to);
        }





        //Languages
        $available_languages=$restaurant->localMenus()->get()->pluck('languageName','id');
        $default_language=null;
        foreach ($restaurant->localMenus()->get() as $key => $localMenu) {