app/Http/Controllers/RideSettingsController.php

select * from `settings_rides`
---
    public function index()
    {
        $settings = SettingsRide::all();